#include <iostream>
#include "geek.hpp"

// Task 1
// Описать очередь с приоритетным исключением
// Реализован в файле geek.h
// ================================================================================================

// Task 2
// Реализовать перевод из десятичной в двоичную систему счисления с использованием стека.
Stack decToBin(int data){
    Stack stk;
    while(true){
        data%2 ? stk.push(1) : stk.push(0);
        data/=2;
        if(!data) break;
    }
    return stk;
}
// ================================================================================================

int main(){
    // Проверка первого задания
    std::cout << "Task 1:\n";
    Queue q;
    q.add(1, 5);
    q.add(2, 2);
    q.add(3, 2);
    q.add(4, 2);
    q.add(5, 3);
    q.print();
    for(int i = 0; i < 3; ++i){
        q.extract();
        std::cout << std::endl;
        q.print();
    }
    std::cout << std::endl;
    // ==========================================

    // Проверка второго задания
    // В задании не сказано как хранить конвертированное число,
    // поэтому я оставил его в стеке
    std::cout << "Task 2:\n";
    const int DEC = 18;
    Stack s = decToBin(DEC);
    s.print();
    // ==========================================
    return 0;
}